tutorials/reactiveTransport/reactiveTransportFoam/2DGrainstoneBimolecular/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

velocity volumeAveraged;
pressureDrop velocityWeightedAverageViscousForce;

inletName inlet;
outletName outlet;

x1 0;
x2 .001;

y1 0;
y2 .0005;

z1 0;
z2 .000010;

direction 0;
